MusicApp/app/controllers/albums_controller.rb

	def new
		@album = Album.new
		@bands = Band.all
		@owner_band = Band.find(params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT 1  [["id", "6"]]

	def create
		@bands = Band.all
		@album = Album.new(album_params)
		@owner_band = Band.find(params[:album][:band_id])
		if @album.save
---
SELECT "bands".* FROM "bands"
SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "albums" ("band_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["band_id", 11], ["created_at", Fri, 31 Oct 2014 00:02:00 UTC +00:00], ["name", "asd"], ["style", "Live"], ["updated_at", Fri, 31 Oct 2014 00:02:00 UTC +00:00]]