MusicApp/app/controllers/bands_controller.rb

	def create
		@band = Band.new(band_params)
		if @band.save
---
INSERT INTO "bands" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 30 Oct 2014 22:04:28 UTC +00:00], ["name", "The Who"], ["updated_at", Thu, 30 Oct 2014 22:04:28 UTC +00:00]]