MusicApp/app/controllers/tracks_controller.rb

	def new
		@track = Track.new
		@albums = Album.all
		@owner_album = Album.find(params[:album_id])
---
SELECT "albums".* FROM "albums"
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1"]]

	def create
		@track = Track.new(track_params)
		@albums = Album.all
		@owner_album = Album.find(params[:track][:album_id])
		if @track.save
---
SELECT "albums".* FROM "albums"
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "tracks" ("album_id", "created_at", "lyrics", "name", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["album_id", 1], ["created_at", Fri, 31 Oct 2014 00:33:49 UTC +00:00], ["lyrics", "sdfas"], ["name", "asdf"], ["status", "Regular"], ["updated_at", Fri, 31 Oct 2014 00:33:49 UTC +00:00]]