app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "session_token", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save